{"chapters":[
  {
    "id": 1,
    "name" : "شروط صحةالصلاة",
    "content":"شروط صحة الصَّلاة: وهي خمسة شروطٍ لابُد من توافرها وهي:\nدخول الوقت: أي وقت الصَّلاة والذي يبدأ من الأذان ويسّتمرّ حتى أذان الصَّلاة التَّالية. ومن غَفِل عن إحدى الصَّلوات أو كان نائمًا وخرج وقتها وبدأ وقت الذي يليها؛ فعليه قضاء الصَّلاة الفائتة متى ما تذكرها فورًا.\nوعورة الرَّجل الواجب سترها المنطقة من الجسد الواقعة ما بين السُّرة والرُّكبتيْن، أمّا المرأة فكلُّ جسدها عورةٌ يجب ستره.ستر العورة: والعورة في الشّرع هي كلُّ ما يجب تغطيته، ويقبح ظهوره ويُستحَى منه، ويُعتبر كشّف العورة من الفواحش\nاجتناب النَّجاسة: فعلى المُصلِّي اجتناب النَّجاسة في البدن والثَّوب والبقعة التي يقف عليها للصَّلاة،\nاستقبال القِبلة: والقِبلة هي الكعبة المُشرّفة؛ فعلى جميع المُصلِّين من كافّة أرجاء الأرض التَّوجه نحو الكعبة في صلاتهم الفريضة والنَّافلة.\nالنِّية: يُقصد بالنِّية شرعًا هي العزم والقّصد على فِعل أمرٍ تقربًا وإرضاءً لله تعالى وامتثالًا لأوامره، ومحلّ النِّية هو القلب؛ فلا حاجة للتّلفظ بها عند فعل العبادة، ومن تلفّظ بها فهو مبتدعٌ لعدم ثبوت ذلك عن النَّبي صلى الله عليه وسلم ولا عن أصحابه؛ فعلى المسلم أنْ ينوي ويعقد العزَم في قلبه الصَّلاة التي يريدها؛ فلا يقل عند الوقوف بين يدي الله: نويتُ صلاة الظُّهر أو غيرها وإنَّما يقل: الله أكبر- تكبيرة الإحرام- ويَشرع في صلاته."
  },

  {
    "id": 2,
    "name" : "كيفية الصلاة",
    "content":"أن يستقبل القبلة بجميع بدنه بدون انحراف ولا التفات.\nثم ينوي الصلاة التي يريد أن يصليها بقلبه بدون نطق النية.\nثم يكبر تكبيرة الإحرام فيقول: (الله أكبر) ويرفع يديه إلى حذو منكبيه عند التكبير.\nثم يضع كف يده اليمنى على ظهر كف يده اليسرى فوق صدره.\nثم يستفتح فيقول: «اللَّهمَّ باعِدْ بَيْني وبَيْن خَطايايَ كما باعَدْتَ بَيْنَ المشرِقِ والمغرِبِ اللَّهمَّ نقِّني مِن الخَطايا كما يُنقَّى الثَّوبُ الأبيضُ مِن الدَّنَسِ اللَّهمَّ اغسِلْني مِن خَطايايَ بالماءِ والثَّلجِ والبَرَدِ». أو يقول: «سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ. تَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ. وَلاَ إِلهَ غَيْرُكَ».\nثم يتعوذ فيقول: (أعوذ بالله من الشيطان الرجيم).\nثم يبسمل ويقرأ الفاتحة\nثم يقرأ ما تيسر من القرآن ويطيل القراءة في صلاة الصُّبۡحَ.\nثم يركع، أي يحني ظهره تعظيمًا لله ويُكبر عند ركوعه ويرفع يديه إلى حذو منكبيه. والسنة أن يهصر ظهره ويجعل رأسه حياله ويضع يديه على ركبتيه مفرجتي الأصابع\nويقول في ركوعه: (سبحان ربي العظيم) ثلاث مرات، وإن زاد: (سبحانك اللهم وبحمدك، اللهم اغفر لي) فحسن.\nثم يرفع رأسه من الركوع قائلًا: (سمع الله لمن حمده) ويرفع يديه حينئذ إلى حذو منكبيه. والمأموم لا يقول سمع الله لمن حمده، وإنما يقول بدلها: (ربنا ولك الحمد).\nثم يقول بعد رفعه: (ربنا ولك الحمد، ملء السماوات والأرض وملء ما شئت من شيء بعد).\nثم يسجد خشوعًا السجدة الأولى ويقول عند سجوده: (الله أكبر) ويسجد على أعضائه السبعة: الجبهة والأنف، والكفين، والركبتين، وأطراف القدمين، ويجافي عضديه عن جنبيه ولا يبسط ذراعيه على الأرض، ويستقبل برؤوس أصابعه القبلة.\nويقول في سجوده: (سبحان ربي الأعلى) ثلاث مرات، وإن زاد: (سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي) فحسن.\nثم يرفع رأسه من السجود قائلًا: (الله أكبر).\nثم يجلس بين السجدتين على قدمه اليسرى، وينصب قدمه اليمنى، ويضع يده اليمنى على طرف فخذه الأيمن مما يلي ركبته، ويقبض منها الخنصر والبنصر، ويرفع السبابة ويحركها عند دعائه، ويجعل طرف الإبهام مقرونًا بطرف الوسطى كالحلقة، ويضع يده اليسرى مبسوطة الأصابع على طرف فخذه الأيسر مما يلي الركبة.\nويقول في جلوسه بين السجدتين: (رب اغفر لي وارحمني واهدني وارزقني واجبرني وعافني).\nثم يسجد خشوعًا منه السجدة الثانية كالأولى فيما يُقال ويُفعل، ويكبر عند سجوده.\nثم يقوم من السجدة الثانية قائلًا: (الله أكبر) ويصلي الركعة الثانية كالأولى فيما يُقال ويفعل إلا أنه لا يستفتح فيها.\nثم يجلس بعد انتهاء الركعة الثانية قائلًا: (الله أكبر) ويجلس كما يجلس بين السجدتين سواء.\nويقرأ التشهد في هذا الجلوس فيقول: «التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ. اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.»، وكان النبي يدعو بعدها فيقول: «اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِن عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ القَبْرِ، وَمِنْ فِتْنَةِ المَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ» ثم يدعو ربه بما أحب من خيري الدنيا والآخرة.\nثم يسلم عن يمينه قائلاٌ: (السلام عليكم ورحمة الله) وعن يساره كذلك.\nوإذا كانت الصلاة ثلاثية أو رباعية وقف عند منتهى التشهد الأول وهو: (أشهد أن لا إله إلا الله وأشهد أن محمدًا عبده ورسوله).\nثم ينهض قائمًا قائلًا: (الله أكبر) ويرفع يديه إلى حذو منكبيه حينئذ.\nثم يصلي ما بقي من صلاته على صفة الركعة الثانية، إلا أنه يقتصر على قراءة الفاتحة.\nثم يجلس متوركًا فينصب قدمه اليمنى ويخرج قدمه اليسرى من تحت ساق اليمنى ويُمكن مقعدته من الأرض، ويضع يديه على فخذيه على صفة وضعها في التشهد الأول.\nويقرأ في هذا الجلوس التشهد كله.\nثم يسلم عن يمينه قائلًا: (السلام عليكم ورحمة الله) وعن يساره كذلك."
  },

  {
    "id":3,
    "name" : "كيفة صلاة الجنازة",
    "content":"هي صلاة على الميت، يصليها المرء وهو قائم فلا ركوع فيها ولا سجود. وإن كان مأموما اقتدى بالإمام.وكيفيتها هي:\nالتكبيرة الأولى: أن يكبر ثم يقرأ الفاتحة.\nالتكبيرة الثانية: ثم يكبر التكبيرة الثانية ثم يقرأ النصف الأخير من التشهد(الصلاة الإبراهيمية).\nلتكبيرة الثالثة: ثم يكبر التكبيرة الثالثة ثم يدعو للميت بما شاء من الأدعية ومنها [بحاجة لدقة أكثر] ' (اللهم اغفر له وارحمه اللهم وسع مدخله اللهم اكرم نزله اللهم مد له في قبره مد بصره اللهم ابدله دارا خيرا من داره واهلا خيرا من اهله اللهم اعف عنه اللهم ارحمه) \nالتكبيرة الرابعة: ثم يكبر التكبيرة الرابعة ثم يقول \"اللهم لا تحرمنا أجره ولا تَفتِنـّا بعده واغفر اللهم لنا وله\" ويدعو للميت ولجميع المسلمين وينهي صلاته بالتسليم."
  },
  {
    "id": 4,
    "name" : "كيفة صلاة الاستخارة",
    "content":"طريقة صلاة الاستخارة بالتفصيل\nوهناك عدد من الخطوات الضرورية واللازمة لصلاة الاستخارة، ويأتي في المقدمة استحضار عظمة الله سبحانه وتعالى القادر على كل شيء، ونية الاستخارة واليقين بالله سبحانه وتعالى، ويفضل قول دعاء الاستخارة بعد صلاة ركعتين \nويتم أداء صلاة الاستخارة ركعتين، ومن السنة أنّ تقرأ بعد الفاتحة في الركعة الأولى سورة الكافرون، أما في الركعة الثانية يتم الاستعانة بسورة الإخلاص بعد الفاتحة.\nوبعد الانتهاء من الصلاة تمامًا، رفع الأيدي بالدعاء مستحضرًا عظمة الله، وتحمد الله وتثنى عليه وتصلى على النبى صلى الله عليه وسلم والأفضل أن تكون الصلاة على النبى بالصيغة الإبراهيمية «التى تقال فى النصف الثانى من التشهد».\nثم تقرأ دعاء الاستخارة: «اللَّهُمَّ إنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ فَإِنَّكَ تَقْدِرُ وَلا أَقْدِرُ، وَتَعْلَمُ وَلا أَعْلَمُ، وَأَنْتَ عَلامُ الْغُيُوبِ.. اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ (اذكر حاجتك) خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي؛ فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ.. اللَّهُمَّ وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ (اذكر حاجتك) شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِي الْخَيْرَ حَيْثُ كَانَ ثُمَّ ارْضِنِي بِهِ.» ثم تصلى على النبى مرة أخرى بالصيغة الإبراهيمية.\nأوقات صلاة الاستخارة\nويعد الثلث الأخير من الليل وقبل صلاة الفجر، لما روي عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ يَقُولُ: مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ، مَنْ يَسْأَلُنِي فَأُعْطِيَهُ، مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ» رواه البخاري (1145)، ومسلم (758)."
  },
  {
    "id": 5,
    "name" : "كيفة صلاة قيام الليل",
    "content":"للمسلم أن يصلي ما شاء سواء ركعتين أو زيادة ويجزيه الله تبارك وتعالى على صلاته قلت أو زادت، ولكن الأهم هو المداومة على صلاة قيام الليل فكان النبي يحب أدوم الأعمال حتى وإن قلت.\nوقت صلاة قيام الليل\nيبدأ من بعد صلاة العشاء وينتهي بأذان الفجر، ومن نام بعد أن صلى العشاء ثم استيقظ فهذا يسمونه تهجدًا فالتهجد من ضمن قيام الليل، وأفضل وقت فى هذه المدة هو الثلث الأخير من الليل ومعرفة الثلث الأخير من الليل يكون بتقسيم الوقت من العشاء إلى الفجر إلى ثلاثة أقسام، إلا أن هناك اعتقادا شائعا بين البعض أنه لا يؤجر على صلاة قيام الليل إلا بعد نوم، وهذا خطأ شائع يجب على الجميع تغييره تماما، وصلاة قيام الليل تجوز في أي وقت حتى ولو كانت بعد صلاة العشاء مباشرة.\nكيفية صلاة قيام الليل\nقال رسول الله \"صلاة الليل مثنى مثنى، فإذا خشي أحدكم الصّبح صلى ركعةً واحدةً، توتر له ما قد صلى\"، فمن صلى العشاء وصلى بعدهم 4 ركعات ونام ثم استيقظ وصلى 4 ركعات فيجوز له ذلك وإن كان صلى 8 ركعات متواصلين يجوز أيضًا ولكن الأفضل أن يكونوا منفصلين."
  },
  {
    "id":6,
    "name" : "كيفة صلاة الحاجة",
    "content":" كيفية صلاة الحاجة \nصلاة الحاجة تؤدى  ركعتين بتسليمةٍ واحدةٍ، ثم التوجّه إلى الله -تعالى- والثناء عليه، والصلاة على النبي محمدٍ صلّى الله عليه وسلّم، ثمّ يسأل العبد حاجته من الله عز وجل ، فقد جاء بالحديث قول النبي صلى الله عليه وسلم: (من توضأ فأسبغ الوضوء ثم صلى ركعتين بتمامهما أعطاه الله ما سأل معجلا ومؤخرا).\nدعاء صلاة قضاء الحاجة\nالرسول صلى الله عليه وسلم قال إذا كان لعبد عند الله حاجة او بني آدم فقام فتوضأ وأحسن الوضوء ثم أحمد الله وأثنى عليه وصلى على النبي صلى الله عليه وسلم ثم قل: \"لا إله الا الله الحليم الكريم سبحان الله رب العرش العظيم والحمد لله رب العالمين أسألك بموجبات رحمتك وعزائم مغفرتك والغنيمة من كل بر والسلامة من كل إثم ربي لا تجعل ذنبا الا غفرته ولا حاجة من حوائج الدنيا هي لك فيها رضا ولنا فيها صلاح الا قضيتها ويسرتها يا أرحم الراحمين \"ثم يدعو بعد ذلك بخيري الدنيا والآخرة وسيجاب بإذن الله تعالى.\n"
  },

  {
    "id": 7,
    "name" : " كيفية صلاة الضحى ",
    "content":" صلاة الضحى سنة أوصى بها النبي ﷺ بعض أصحابه، وفعلها في بعض الأحيان -عليه الصلاة والسلام- وفعلها يوم الفتح، صلى ثمان ركعات الضحى يوم الفتح، فهي سنة مؤكدة.\nووقتها ما بين ارتفاع الشمس قيد رمح إلى وقوف الشمس الضحى كله، وقتها ما بين ارتفاع الشمس قيد رمح إلى وقوف الشمس قبيل الظهر، فإذا صلاها في أول الوقت، أو في أثنائه؛ فقد أصاب السنة، لكن أفضلها عند اشتداد الضحى، إذا اشتد الحر، ورمضت الفصال كما قال ﷺ في الحديث الصحيح يقول ﷺ صلاة الأوابين حين ترمض الفصال يعني: حين يشتد حر الرمضاء على أولاد الإبل، فصلاتها في الضحى في ارتفاع الضحى أفضل، وإن صلاها بعد ارتفاع الشمس؛ فقد حصلت السنة.\nويقرأ فيها ما تيسر سورًا، أو آيات ليس فيها شيء مخصوص، يقرأ فيها ما تيسر من الآيات، أو من السور.\nوأقلها ركعتان تسليمة واحدة، وإن صلى أربعًا، أو ستًا، أو ثمانًا، أو أكثر، يسلم من كل ثنتين؛ فكله حسن، والنبي ﷺ صلاها يوم الفتح، صلى ثماني ركعات، يسلم من كل ثنتين -عليه الصلاة والسلام- نعم."
  }

]}